## [DataFrame 인덱스 다루기]

- (1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

### (1) 모듈 불러오기

In [7]:
import pandas as pd

### (2) 데이터 준비

In [4]:
# Dict type의 데이터를 준비한다
exam = {"이름" : ['마징가', "배트맨", "홍길동", "임꺽정"],
       "국어" : [98, 78, 45, 79],
       "미술" : [100, 54, 71, 34],
       "수학" : [88, 45, 82, 52],
       "체육" : [98, 84, 55, 13]}

(3) 데이터 저장

In [6]:
examDF = pd.DataFrame(exam)
examDF

    이름  국어   미술  수학  체육
0  마징가  98  100  88  98
1  배트맨  78   54  45  84
2  홍길동  45   71  82  55
3  임꺽정  79   34  52  13

In [ ]:
(4) 데이터 확인

In [8]:
examDF

    이름  국어   미술  수학  체육
0  마징가  98  100  88  98
1  배트맨  78   54  45  84
2  홍길동  45   71  82  55
3  임꺽정  79   34  52  13

### (5) 새로운 인덱스 설정 -> 인덱스의 일부 변경 DF.rename()

In [10]:
# 행 인덱스 일부 변경 => {기존 인덱스 : 새로운 인덱스}
examDF.rename(index = {0:"zero"})

       이름  국어   미술  수학  체육
zero  마징가  98  100  88  98
1     배트맨  78   54  45  84
2     홍길동  45   71  82  55
3     임꺽정  79   34  52  13

In [11]:
examDF # rename이 복사본을 준다는 것을 알 수 있음!!

    이름  국어   미술  수학  체육
0  마징가  98  100  88  98
1  배트맨  78   54  45  84
2  홍길동  45   71  82  55
3  임꺽정  79   34  52  13

In [14]:
# inplac 매개변수/파라미터 => 원본 DF에 변경 여부를 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index = {0:"zero"}, inplace=True)

In [15]:
examDF

       이름  국어   미술  수학  체육
zero  마징가  98  100  88  98
1     배트맨  78   54  45  84
2     홍길동  45   71  82  55
3     임꺽정  79   34  52  13

In [18]:
# 열 이름 인덱스 일부 변경
examDF.rename(columns = {"체육":"음악"})

       이름  국어   미술  수학  음악
zero  마징가  98  100  88  98
1     배트맨  78   54  45  84
2     홍길동  45   71  82  55
3     임꺽정  79   34  52  13

In [19]:
examDF

       이름  국어   미술  수학  체육
zero  마징가  98  100  88  98
1     배트맨  78   54  45  84
2     홍길동  45   71  82  55
3     임꺽정  79   34  52  13

In [20]:
examDF.rename(columns = {"체육":"음악"}, inplace = True)
examDF

       이름  국어   미술  수학  음악
zero  마징가  98  100  88  98
1     배트맨  78   54  45  84
2     홍길동  45   71  82  55
3     임꺽정  79   34  52  13